-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Aug 26, 2026 at 01:21 PM
-- Server version: 11.4.12-MariaDB-cll-lve
-- PHP Version: 8.4.24

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `meakncva_mk`
--

-- --------------------------------------------------------

--
-- Table structure for table `tb_students`
--

CREATE TABLE `tb_students` (
  `id` int(11) NOT NULL,
  `school_id` int(11) NOT NULL,
  `student_name` varchar(100) NOT NULL,
  `sex` enum('Male','Female','Other') DEFAULT NULL,
  `dob` date DEFAULT NULL,
  `other` text DEFAULT NULL,
  `photo` varchar(255) DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `tb_students`
--

INSERT INTO `tb_students` (`id`, `school_id`, `student_name`, `sex`, `dob`, `other`, `photo`) VALUES
(37, 1, 'រក្សា សីហា', 'Male', '2011-11-19', '', '697220ed18f83.jpg'),
(38, 1, 'មុន្នី រក្សា', 'Male', '2012-10-19', '', '69722348a0674.jpg'),
(36, 2, 'ឈឿម ចាន់ឌី', 'Male', '2007-05-02', '', '6970bb624068b.jpg'),
(35, 2, 'ព្រេក សារ៉ាន់', 'Female', '2008-08-25', '', '6970ba4ecc370.jpg'),
(34, 2, 'គង់ ស្រីពេញ', 'Female', '2008-06-21', '', '6970b9e6e426c.jpg'),
(33, 2, 'សឿត ណារ៉ែន', 'Female', '2008-11-28', 'ចាប់ខែ ១ ២០២៦', '6970b63f49d2d.jpg'),
(39, 1, 'វង់ ចន្រ្ទា', 'Female', '2009-08-22', '', '697738e01931d.png'),
(40, 1, 'សួម ពិសី', 'Female', '2009-07-09', '', '69773975b88e2.jpg'),
(41, 1, 'រេត ស្រីនុត', 'Female', '2010-03-03', '', '6a4b7b0d160aa.jpg'),
(42, 1, 'ឡយ កក្កដា', 'Male', '2008-07-07', '', '69773b7506280.jpg'),
(43, 1, 'ប៉ី  ឆវី', 'Female', '2010-07-02', '', '69773bd3c247d.png'),
(44, 1, 'វ៉ាន់ ឡាឡៃយ៉ា', 'Female', '2013-09-20', '', '69773d03291ab.jpg'),
(45, 1, 'ខុម សក្កណា', 'Female', '2010-11-24', '', '697740010a2cf.png'),
(46, 1, 'ស៊ីនិត  ម៉េងហុង', 'Male', '2013-12-19', '', '6979d78802169.jpg'),
(47, 1, 'សាយ ស៊ីណា', 'Female', '2010-10-16', '', '69774261c9967.jpg'),
(48, 1, 'ឃឿម ម៉ាលី', 'Female', '2010-09-03', '', '697742d2c13ed.jpg'),
(49, 1, 'ជន់ ចាន់សុធារ៉ា', 'Female', '2009-08-08', '', '69774476a75a6.jpg'),
(50, 1, 'ស៊ត់  វណ្នី', 'Male', '2008-05-16', '', '697744ecee953.jpg'),
(51, 1, 'អ៊ិន ញ៉ា', 'Female', '2010-04-28', '', '697745ad4f281.jpg'),
(52, 1, 'ឡាច  ធាវី', 'Female', '2010-11-22', '', '697746599725e.jpg'),
(53, 1, 'ភឿង  រក្សា', 'Male', '2010-01-24', '', '697746bec8fe8.jpg'),
(54, 1, 'ហឿម មេត្តា', 'Male', '2013-01-12', '', '6979d6903db76.jpg'),
(55, 1, 'ញ៉ឹង បញ្ញា ', 'Male', '2009-10-16', '', '6979d6ab4dccc.jpg'),
(56, 1, 'អ៊ត់ គឹមហ៊ង់', 'Female', '2010-06-24', '', '6979d8ff63ae5.png'),
(57, 1, 'ក្រូច នេត្រា', 'Female', '2010-12-10', '', '6979da2c32446.png'),
(58, 1, 'ឃិត  សុខុន', 'Male', '2010-10-18', '', '6979db03ea26f.png'),
(59, 1, 'ស៊ុតសេង សាលីណា', 'Female', '2013-05-17', '', '69927c6dd2306.jpg'),
(60, 1, 'រឹទ្ធ ធិរាជ្យ', 'Male', '2013-05-31', '', '6979dc5b55b1f.jpg'),
(61, 1, 'តេស្ដ', 'Female', '2009-11-18', 'ត', '6983d50ae61fe.jpg'),
(62, 1, 'តេស្ដ១', 'Male', '2012-11-18', 'ត', '6983d54c4b4ae.jpg'),
(63, 1, 'test1', 'Female', '2011-02-14', 'ថ្មី', '6989cc1ec08c8.jpg'),
(64, 1, 'ធន់ ឡៃហាវ', 'Female', '2011-08-30', 'ថ្មី', ''),
(65, 2, 'ហេង សារុំ', 'Female', '2008-01-01', 'ថ្មី', '698f165ea8f87.jpg'),
(66, 0, 'test1', 'Male', '2024-05-04', 'ថ្មី', '6995504d15cfa.jpg'),
(67, 2, 'តេស្ដ២', 'Female', '2009-11-15', 's', '69bfa3967e9da.jpg'),
(68, 1, 'ភក្ដី សុផាន់ដា', 'Female', '2016-04-22', '', '69c0ebf1a5da3.png'),
(69, 1, 'ធឺន ថង', 'Male', '2006-04-15', '', '69c0ecaee90f1.png'),
(70, 1, 'អឿមគង់ ធូរេន', 'Female', '2009-09-09', '', '69c0f41eecabe.jpg'),
(71, 1, 'ថេត ឃីម', 'Female', '2012-08-12', '', '69c2476bebdea.jpg'),
(72, 1, 'សេង ដាឡែន ', 'Female', '2014-02-13', '', '69c0f558933f1.png'),
(73, 1, 'កៃ រដ្ឋា', 'Male', '2014-03-09', '', '69c24c0e31505.jpg'),
(74, 1, 'យន់ សម្បត្ដិ', 'Male', '2008-05-05', 'រដ្ឋបាល', ''),
(75, 1, 'ម៉ោង មីត', 'Male', '2008-07-06', '', ''),
(76, 1, 'ម៉ុន ប៊ុនថា', 'Male', '2009-05-19', '', ''),
(77, 1, 'អ៊ិន ត្រា', 'Male', '2007-12-24', '', ''),
(78, 1, 'គឿត តុលា', 'Female', '2007-10-22', '', '69c0f8f751a9b.png'),
(79, 1, 'ចាប វល័ក្ខ', 'Female', '2008-12-20', '', '69c0f93ea46aa.png'),
(80, 1, 'សល សាវង្ស', 'Female', '2009-08-28', '', '69ca588bd54bd.png'),
(81, 1, 'ផយ សុផល', 'Female', '2006-10-07', '', '69c0fa16b23be.png'),
(82, 1, 'ឆាត គិមលៀង ', 'Female', '2006-02-10', '', '69ca542b6dee5.png'),
(83, 1, 'រ៉ា សារៀង', 'Female', '2008-05-11', '', '69c0fae70f87d.png'),
(84, 1, 'នី សំនៀង', 'Female', '2009-12-10', '', '69c0fb2857d6c.png'),
(85, 1, 'គីម សំអូន', 'Female', '2008-08-07', '', '69c0fb945ba2e.png'),
(86, 1, 'ធន់ ឡៃហាវ', 'Female', '2011-08-26', '', '69c0fc428f420.png'),
(87, 1, 'សឿប សារីណា', 'Female', '2013-03-26', '', '69c3b7e6a112a.jpg'),
(88, 1, 'តិត វល័ក្ខ', 'Female', '2013-07-09', '', '69c0fd4ded443.jpg'),
(89, 1, 'បូយ ផាន្នី', 'Female', '2010-10-17', '', '69c0fe6baf2ca.jpg'),
(90, 1, 'រុំា  សូរីសា', 'Female', '2012-10-03', '', '69c0feff35905.jpg'),
(91, 1, 'ឌី ម៉ារ៉ា ឌីន', 'Male', '2014-01-01', '', '69c0ff45093fc.jpg'),
(92, 1, 'ជឹម សុខចំរើន', 'Male', '2010-10-01', '', '69c0ff8091609.jpg'),
(93, 1, 'សឺង ណាស៊ិន', 'Female', '2012-02-16', '', '69c12e166883d.jpg'),
(94, 1, 'នឿម  ស្រីល័ក្ខ', 'Female', '2012-05-05', '', '69c110c3a6a11.jpg'),
(95, 1, 'យង់ យ៉ត', 'Male', '2000-06-28', 'រដ្ឋបាល', ''),
(96, 1, 'ខី ខេមារ៉ា', 'Female', '2012-12-16', '', '69c2648813cca.jpg'),
(97, 1, 'បូរី អមរា', 'Female', '2013-03-04', '', '69c264e3b57e7.png'),
(98, 1, 'ច្រឹក ស៊ីវវុន ', 'Female', '2008-12-21', 'រដ្ឋបាល', ''),
(99, 1, 'អាន ស្រីពៅ', 'Female', '2008-06-04', '', ''),
(100, 1, 'នំ នឿម ', 'Male', '2009-02-09', 'រដ្ឋបាល', ''),
(101, 1, 'ចិក ចិនណា', 'Female', '2007-11-25', 'រដ្ឋបាល', ''),
(102, 1, 'ធុច សុវណ្ណដា', 'Male', '2013-05-03', '', ''),
(158, 1, 'សោន សូវណ្ណលីដា', 'Female', '2015-08-28', 'រដ្ឋបាលលើកទី២', '6a51f6696db29.png'),
(104, 1, 'សុត ប៊ិន', 'Male', '2005-09-05', '', ''),
(105, 1, 'សំ ស្រីនាង', 'Female', '1996-03-06', '', ''),
(106, 1, 'មូសា ហាណាហ្វាយ ', 'Female', '2013-06-18', '', '69c4de0c5aa96.png'),
(108, 1, 'ពុធ សុខលី', 'Female', '2014-12-21', '', '69c4ddfc3e93f.png'),
(109, 1, 'ផា សុភី', 'Female', '2014-12-24', '', '69c4dde1dc4f9.png'),
(110, 2, 'តឿម ស្រីនិត', 'Female', '2007-09-04', 'រដ្ឋបាល', ''),
(111, 2, 'ទាវ ពិសី', 'Female', '2008-10-01', 'រដ្ឋបាល', ''),
(113, 2, 'តឿ គិមលី', 'Female', '2008-09-12', 'រដ្ឋបាល', ''),
(114, 2, 'ធី ស្រីណា', 'Female', '2008-11-18', 'រដ្ឋបាល', ''),
(115, 2, 'ម៉ៃ រស្មី', 'Male', '2008-03-04', 'រដ្ឋបាល', ''),
(143, 1, 'យ៉ាវ ស៊ីណាត', 'Female', '2007-03-07', '', ''),
(144, 1, 'ម៉ាង សុប៊ីន', 'Female', '2008-09-12', 'រដ្ឋបាល', '6a82d09f5d691.jpg'),
(119, 2, 'ផ្លាំង ពរជ័យកុមារ', 'Male', '2012-04-23', 'រដ្ឋបាល', '69e75075a3f5b.png'),
(120, 2, 'សុខ ប្រសើរ', 'Male', '2008-12-14', 'រដ្ឋបាល', '69e8a8ca0c211.jpg'),
(121, 2, 'វិច ធារ៉ា', 'Female', '2010-03-26', 'រដ្ឋបាល', '69e8b0fdbaffc.jpg'),
(122, 1, 'វី សុវណ្ណដារីយ៉ា', 'Female', '2013-02-15', 'ឌីជីថល', '69ca5c137be26.jpg'),
(123, 1, 'អ៊ាត ណាចា', 'Male', '2004-07-14', '', '69cbaa5b4a0c8.jpg'),
(124, 1, 'អ៊ិន វាសនា ', 'Male', '2000-02-10', 'រដ្ឋបាល', '69cbaae117746.jpg'),
(125, 1, 'យឹង ចរិយា', 'Female', '2010-05-02', 'រដ្ឋបាល', ''),
(126, 1, 'ព្រហ្ម សុធីណា', 'Female', '2009-09-10', 'រដ្ឋបាល', ''),
(127, 1, 'និន ស្រីនីត', 'Female', '2007-12-13', 'រដ្ឋបាល', ''),
(128, 1, 'ធត់ ថាន', 'Male', '2008-03-02', '', '69ccdb648a798.png'),
(129, 2, 'ពុធ ប៊ុនឆាង', 'Male', '2007-05-05', 'photoshop', '69e8c7c46fdc9.png'),
(130, 2, 'ម៉ក់ ពោរ', 'Male', '1982-02-17', 'គ្រូ គណិត ', '69f88320dafe3.png'),
(131, 2, ' ពុធ ប៊ុនឈុន', 'Male', '2008-11-13', '', '69e8c822c5c41.png'),
(132, 2, 'ម៉ន សាមី', 'Female', '2008-05-01', '', '69e9d7966f932.jpg'),
(133, 2, 'វឿង ខាំមីង', 'Female', '2011-05-08', '', ''),
(134, 2, 'សាំ គឹមចុង', 'Male', '2013-12-29', '', '69e76602e2736.png'),
(135, 2, 'យ៉ាន ចាន់មី', 'Female', '2014-01-09', '', '69e8a34b8dd59.jpg'),
(137, 2, 'ទាវ ពិសី', 'Female', '2008-01-10', '', ''),
(138, 2, 'ណុល វិសាល', 'Male', '2007-12-21', '', '69e8a649e95f4.jpg'),
(139, 2, 'ហឿម សុខរក្សា', 'Male', '2007-08-26', '', '69e741ec5bb5b.jpg'),
(140, 2, 'ជឿន សុវន្នី', 'Male', '2014-04-22', 'រដ្ឋបាល', '69e8a4cd1250d.jpg'),
(141, 2, 'វឿង ខាំមីង', 'Female', '2011-05-08', 'រដ្ឋបាល', ''),
(142, 2, 'សាំ រុី', 'Female', '2007-02-26', 'រដ្ឋបាល', '69e76a7f0986f.png'),
(145, 2, 'ជឿន សុភាន', 'Male', '2006-03-20', 'រដ្ឋបាល', ''),
(146, 2, 'ឈឿយ មេសា', 'Male', '2008-04-15', 'រដ្ឋបាល', ''),
(147, 2, 'ឈឿយ សុខហេង', 'Male', '2007-12-25', 'រដ្ឋបាល', ''),
(148, 2, 'ឈឿយ ទេពធីតា', 'Female', '2015-07-06', 'រដ្ឋបាល', ''),
(149, 1, 'គង់ ចាន់ណៃ', 'Male', '2010-10-21', 'រដ្ឋបាល', '6a7457292f2f6.png'),
(150, 1, 'ធាំង ផានិត', 'Male', '2012-11-19', 'រដ្ឋបាល', '6a7aedb7ce72e.jpg'),
(151, 1, 'ឡាប លីនិញ', 'Male', '2013-10-10', '', '6a5f46c314da0.jpg'),
(152, 1, 'សេង ស្រីហេង', 'Female', '2015-12-12', 'សិស្សធ្វើសៀវភៅ', ''),
(153, 1, 'ណន សំនៀង', 'Male', '2009-01-01', '', '6a31010ad4d48.jpg'),
(154, 1, 'ប៉ាវ សីហា', 'Male', '2011-08-14', 'រដ្ឋបាល', '6a5f4d2660850.jpg'),
(155, 1, 'ហឿម មេត្តា', 'Male', '2013-01-12', 'រដ្ឋបាល', '6a4b7e71caf9e.jpg'),
(156, 1, 'ស៊ីនិត  ម៉េងហុង', 'Male', '2013-09-12', 'រដ្ឋបាល', '6a4b7e5e759ac.jpg'),
(157, 1, 'ហេនស៊ាង ហ័រ', 'Female', '2015-07-25', '', '6a51f69263689.jpg'),
(159, 1, 'ស៊ាន រចនា ', 'Female', '2016-01-08', 'រដ្ឋបាល', '6a55f167d1732.jpg'),
(160, 1, 'រ៉ី សារ៉ា', 'Female', '2009-04-03', 'រដ្ឋបាល', '6a5613c0c74ba.jpg'),
(161, 2, 'មៀត សំអូន', 'Male', '2007-05-18', 'រដ្ឋបាល', ''),
(162, 1, 'ឡេង សៀវហួរ', 'Male', '2009-11-15', 'ឌីសាញ', '6a7aebd784f18.png'),
(163, 1, 'ឡា សុឡែម', 'Male', '2011-03-02', 'រដ្ឋបាល', '6a7456fbf1889.jpg'),
(164, 1, 'ឡាក់ ប៊ីឡាញ', 'Male', '2011-10-13', 'រដ្ឋបាល', '6a7456e9ed5b6.png'),
(165, 2, 'សារី សីហា', 'Male', '2012-06-08', 'រដ្ឋបាល', ''),
(166, 1, 'ឈឿន យូរៀន', 'Female', '2010-08-25', '', ''),
(184, 1, 'បូរី អមរា (ត)', 'Female', '2012-10-11', 'រំលឹក ឌីជីថល និង ការបោះពុម្ព ការ បង្កើតសៀវភៅ ', ''),
(183, 1, 'ម៉ាណែត', 'Male', '2012-07-08', '', ''),
(170, 1, 'ហ៊ីង គិមហី', 'Female', '2010-09-05', '', '6a82cbd54d871.jpg'),
(171, 1, 'សៀងហៃ សៀងហន', 'Female', '2011-03-14', '', '6a82cbc0d0210.jpg'),
(172, 1, 'ឈូក លីណា', 'Female', '2009-11-24', '', '6a82cbae31ecc.jpg'),
(173, 2, 'ចំរើន ឧត្តម', 'Male', '2013-09-28', 'រដ្ឋបាល', ''),
(174, 2, 'រៀវ សំអាត', 'Female', '1996-05-03', 'រដ្ឋបាល', ''),
(175, 2, 'អ៊ុម ជាវណ្ណរី', 'Female', '2008-10-19', 'រដ្ឋបាល', ''),
(176, 2, 'អ៊ុម វណ្ណនីកា', 'Female', '2011-06-29', 'រដ្ឋបាល', ''),
(177, 2, 'ដុង ឌឿ', 'Male', '2007-01-07', 'រដ្ឋបាល', ''),
(178, 2, 'លឿត ថាវង្ស', 'Male', '2009-08-08', 'ឌីជីថល', ''),
(179, 2, 'ឈឺន សីហៈ ', 'Male', '2011-04-04', 'now', ''),
(180, 2, 'ពុធ ប៊ុនឆាង', 'Male', '2007-05-05', 'now', ''),
(181, 2, 'ភាត់ រង្សី ', 'Male', '2009-09-23', 'now', ''),
(182, 2, 'មេន មួយ', 'Male', '2010-08-06', 'now', ''),
(185, 1, 'គឹម ផាត្ដាណា', 'Male', '2010-08-06', 'បង់ខែ ', ''),
(186, 1, 'វ៉ិត សុវណ្ណ', 'Male', '2011-09-11', 'លោកសង្ឍ', ''),
(187, 1, 'សៅ សិម', 'Male', '2008-11-14', 'លោកសង្ឍ', ''),
(188, 1, 'ចិន យ៉ាង', 'Male', '2009-11-17', 'លោកសង្ឍ', ''),
(189, 1, 'រេត ស្រីនុត', 'Female', '2009-11-17', 'ឌីជីថល', '');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tb_students`
--
ALTER TABLE `tb_students`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `tb_students`
--
ALTER TABLE `tb_students`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=190;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
