-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Aug 26, 2026 at 01:25 PM
-- Server version: 11.4.12-MariaDB-cll-lve
-- PHP Version: 8.4.24

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `meakncva_mk`
--

-- --------------------------------------------------------

--
-- Table structure for table `tb_invoices`
--

CREATE TABLE `tb_invoices` (
  `id` int(11) NOT NULL,
  `student_name` varchar(255) NOT NULL,
  `description` varchar(255) DEFAULT NULL,
  `amount` decimal(10,2) NOT NULL,
  `status` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `study_time` varchar(50) DEFAULT NULL,
  `school_id` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `tb_invoices`
--

INSERT INTO `tb_invoices` (`id`, `student_name`, `description`, `amount`, `status`, `created_at`, `study_time`, `school_id`) VALUES
(19, 'ឈឿម ចាន់ឌី', 'y', 30.00, 0, '2026-01-21 12:39:27', '1:00 - 2:00 pm', 0),
(20, 'ព្រេក សារ៉ាន', 'a', 30.00, 0, '2026-01-22 13:01:34', '1:00 - 2:00 pm', 0),
(21, 'មុន្នី រក្សា', 's', 35.00, 0, '2026-01-22 13:13:24', '10:00 - 11:00 am', 0),
(22, 'test1', 'yort ', 15.00, 0, '2026-02-11 06:37:52', '1:00 - 2:00 pm', 0),
(23, 'តេស្ដ២', 'ns', 30.00, 0, '2026-03-22 09:04:25', '1:00 - 2:00 pm', 0),
(24, 'ជឹម សុខចំរើន', 's', 20.00, 0, '2026-03-23 11:04:18', '5:00 - 6:00 pm', 0),
(25, 'ឌី ម៉ារ៉ា ឌីន', 's', 20.00, 0, '2026-03-23 11:04:34', '5:00 - 6:00 pm', 0),
(26, 'រុំា  សូរីសា', 's', 30.00, 0, '2026-03-23 11:06:02', '5:00 - 6:00 pm', 0),
(27, 'សឺង ណាស៊ិន', 's', 30.00, 0, '2026-03-23 11:06:23', '6:00 - 7:00 pm', 0),
(28, 'បុយ ផាន្នី', 's', 12.50, 0, '2026-03-23 11:07:04', '5:00 - 6:00 pm', 0),
(29, 'តិត វល័ក្ខ', 's', 30.00, 0, '2026-03-23 11:07:34', '5:00 - 6:00 pm', 0),
(30, 'ធន់ ឡៃហាវ', 'd', 15.00, 0, '2026-03-23 11:08:59', '5:00 - 6:00 pm', 0),
(31, 'គីម សំអូន', 's', 25.00, 0, '2026-03-23 11:09:16', '4:00 - 5:00 pm', 0),
(32, 'រ៉ា សារៀង', 'h', 15.00, 0, '2026-03-23 11:09:50', '4:00 - 5:00 pm', 0),
(33, 'អ៊ិន ត្រា', 'w', 15.00, 0, '2026-03-23 11:11:48', '4:00 - 5:00 pm', 0),
(34, 'សល សាវង្ស', 's', 10.00, 0, '2026-03-23 11:14:38', '4:00 - 5:00 pm', 0),
(35, 'ផយ សុផល', 's', 12.50, 0, '2026-03-23 11:15:16', '4:00 - 5:00 pm', 0),
(36, 'ថេត ឃីម', 's', 30.00, 0, '2026-03-23 11:16:01', '2:00 - 3:00 pm', 0),
(37, 'សេង ដាឡែន ', 's', 25.00, 0, '2026-03-23 11:16:47', '2:00 - 3:00 pm', 0),
(38, 'នឿម  ស្រីល័ក្ខ', 'រួចរាល់', 30.00, 0, '2026-03-23 11:18:40', '6:00 - 7:00 pm', 0),
(39, 'គឿត តុលា', 'ស', 15.00, 0, '2026-03-23 11:19:34', '4:00 - 5:00 pm', 0),
(40, 'យន់ សម្បត្ដិ', 's', 22.50, 0, '2026-03-23 11:20:34', '3:00 - 4:00 pm', 0),
(41, 'ម៉ោង មីត', 's', 27.50, 0, '2026-03-23 11:21:13', '3:00 - 4:00 pm', 0),
(42, 'គង់ ស្រីពេញ', 'j', 30.00, 0, '2026-03-23 11:23:21', '1:00 - 2:00 pm', 0),
(43, 'ហេង សារុំ', '1', 30.00, 0, '2026-03-24 09:51:47', '1:00 - 2:00 pm', 0),
(44, 'សឿត ណារ៉ែន', 'g', 30.00, 0, '2026-03-24 09:52:14', '1:00 - 2:00 pm', 0),
(45, 'បុយ ផាន្នី', 'ស', 5.00, 0, '2026-03-24 10:10:27', '5:00 - 6:00 pm', 0),
(46, 'បុយ ផាន្នី', 'z', 12.50, 0, '2026-03-24 10:13:03', '5:00 - 6:00 pm', 0),
(47, 'មូសា ហាណាហ្វាយ ', 's', 10.00, 0, '2026-03-25 06:40:14', '6:00 - 7:00 pm', 0),
(48, 'ផា សុភី', 'e', 12.50, 0, '2026-03-25 06:40:59', '6:00 - 7:00 pm', 0),
(49, 'សឿប សារីណា', 's', 20.00, 0, '2026-03-25 10:01:20', '5:00 - 6:00 pm', 0),
(50, 'សុខ ប្រសើរ', 'OK', 30.00, 0, '2026-03-27 10:55:02', '5:00 - 6:00 pm', 0),
(51, 'ផ្លាំង ពរជ័យកុមារ', 'OK', 30.00, 0, '2026-03-28 13:52:47', '5:00 - 6:00 pm', 0),
(52, 'ឆាក គីមលៀង ', 'DS', 30.00, 0, '2026-03-30 10:24:49', '4:00 - 5:00 pm', 0),
(53, 'ឆាក គិមលៀង ', 'ដ', 30.00, 0, '2026-03-30 11:06:41', '4:00 - 5:00 pm', 0),
(54, 'វី សុវណ្ណដារីយ៉ា', 'ដ', 30.00, 0, '2026-03-30 11:19:06', '5:00 - 6:00 pm', 0),
(55, 'អ៊ាត ណាចា', 'with border price', 9.50, 0, '2026-04-01 07:29:30', '5:00 - 6:00 pm', 0),
(56, 'អ៊ិន វាសនា ', 'border ', 9.50, 0, '2026-04-01 07:29:51', '6:00 - 7:00 pm', 0),
(57, 'វិច ធារ៉ា', 'gg', 30.00, 0, '2026-04-02 12:43:16', '6:00 - 7:00 pm', 0),
(58, 'ពុធ ប៊ុនឆាង', 'រួច', 30.00, 0, '2026-04-21 07:49:39', '08:00', 0),
(59, ' ពុធ ប៊ុនឈុន', 'រួច', 30.00, 0, '2026-04-21 07:50:14', '6:00 - 7:00 pm', 0),
(60, 'វឿង ខាំមីង', 'រួច', 30.00, 0, '2026-04-21 07:50:40', '6:00 - 7:00 pm', 0),
(61, 'សាំ គឹមចុង', 'រួច', 30.00, 0, '2026-04-21 07:58:17', '6:00 - 7:00 pm', 0),
(62, 'ហឿម សុខរក្សា', 'រួច', 30.00, 0, '2026-04-21 09:14:20', '4:00 - 5:00 pm', 0),
(63, 'ម៉ក់ ពោរ', 'រួច', 30.00, 0, '2026-04-21 09:16:33', '4:00 - 5:00 pm', 0),
(64, 'សាំ រុី', 'រួចរាល់', 30.00, 0, '2026-04-22 10:19:27', '6:00 - 7:00 pm', 0),
(65, 'យ៉ាន ចាន់មី', 'រួចរាល់', 30.00, 0, '2026-04-23 12:26:26', '6:00 - 7:00 pm', 0),
(66, 'ជឿន សុវន្នី', 'រួចរាល់', 30.00, 0, '2026-04-23 12:27:31', '6:00 - 7:00 pm', 0),
(67, 'ម៉ន សាមី', 'រួចរាល់', 30.00, 0, '2026-04-23 12:28:09', '6:00 - 7:00 pm', 0),
(68, 'ភក្ដី សុផាន់ដា', 'ត ', 10.00, 0, '2026-05-11 07:42:17', '2:00 - 3:00 pm', 0),
(69, 'ណុល វិសាល', 'រួច', 30.00, 0, '2026-05-11 07:42:43', '4:00 - 5:00 pm', 0),
(70, 'ម៉ាង សុប៊ីន', 'រួច', 30.00, 0, '2026-05-11 11:35:40', '2:00 - 3:00 pm', 0),
(71, 'ជឿន សុភាន', 'រួចរាល់', 30.00, 0, '2026-05-11 13:16:04', '7-8 ល្ងាច', 0),
(72, 'ពុធ សុខលី', 'ទី១', 7.50, 0, '2026-05-23 10:14:08', '6:00 - 7:00 pm', 0),
(73, 'គង់ ចាន់ណៃ', 'ពាក់កណ្ដាល', 15.00, 0, '2026-06-01 11:31:58', '6:00 - 7:00 pm', 0),
(74, 'ធាំង ផានិត', 'ពាក់កណ្ដាល', 15.00, 0, '2026-06-09 09:18:58', '6:00 - 7:00 pm', 0),
(75, 'តិត វល័ក្ខ', 'បង់សម្រាប់ ខែ ៦', 5.00, 0, '2026-06-09 09:24:19', '5:00 - 6:00 pm', 0),
(76, 'នី សំនៀង', 'ឌីជីថល', 17.50, 0, '2026-06-09 09:25:36', '4:00 - 5:00 pm', 0),
(77, 'ឡាប លីនិញ', 'រួចរាល់', 30.00, 0, '2026-06-10 06:54:06', '5:00 - 6:00 pm', 0),
(78, 'អឿមគង់ ធូរេន', 'រួចរាល់', 15.00, 0, '2026-06-11 07:26:45', '2:00 - 3:00 pm', 0),
(79, 'រ៉ា សារៀង', 'បង់ រួច', 15.00, 0, '2026-06-11 08:12:26', '4:00 - 5:00 pm', 0),
(80, 'ភក្ដី សុផាន់ដា', 'បង់ខែ ', 5.00, 0, '2026-06-13 07:06:14', '2:00 - 3:00 pm', 0),
(81, 'ភក្ដី សុផាន់ដា', 'd', 2.50, 0, '2026-06-16 07:10:06', '2:00 - 3:00 pm', 0),
(82, 'ប៉ាវ សីហា', 'រួចរាល់', 30.00, 0, '2026-06-25 11:54:50', '6:00 - 7:00 pm', 0),
(83, 'គង់ ចាន់ណៃ', 'រួចរាល់', 15.00, 0, '2026-06-27 08:52:59', '6:00 - 7:00 pm', 0),
(84, 'សោន សូវណ្ណលីដា', 'បង់ខែ 7', 5.00, 0, '2026-07-13 07:03:12', '2:00 - 3:00 pm', 0),
(85, 'ហេនស៊ាង ហ័រ', 'បង់ខែ ៧', 5.00, 0, '2026-07-15 07:24:07', '2:00 - 3:00 pm', 0),
(86, 'ភក្ដី សុផាន់ដា', 'ខែ៧', 2.50, 0, '2026-07-16 06:53:22', '2:00 - 3:00 pm', 0),
(87, 'ឡាក់ ប៊ីឡាញ', 'រួចរាល់', 30.00, 0, '2026-07-22 09:28:35', '3:00 - 4:00 pm', 0),
(88, 'ឡា សុឡែម', 'ពាក់កណ្ដាល', 12.50, 0, '2026-07-30 13:05:01', '5:00 - 6:00 pm', 0),
(89, 'ឈឿន យូរៀន', 'សល់២០', 10.00, 0, '2026-07-30 13:21:26', '2:00 - 3:00 pm', 0),
(90, 'ភក្ដី សុផាន់ដា', 'monthly', 10.00, 0, '2026-07-30 13:36:58', '2:00 - 3:00 pm', 0),
(91, 'សៀងហៃ សៀងហន', 'ខ្លះ', 10.00, 0, '2026-08-06 09:19:16', '3:00 - 4:00 pm', 0),
(92, 'ហ៊ីង គិមហី', 'ខ្លះ', 10.00, 0, '2026-08-06 09:19:51', '3:00 - 4:00 pm', 0),
(93, 'ឈូក លីណា', 'រួច', 30.00, 0, '2026-08-11 09:02:15', '3:00 - 4:00 pm', 0),
(97, 'សៀងហៃ សៀងហន', 'រួច', 20.00, 0, '2026-08-11 09:10:58', '3:00 - 4:00 pm', 0),
(95, 'ហឿម មេត្តា', 'បង់ខែ', 5.00, 0, '2026-08-11 09:03:25', '08:00', 0),
(96, 'ស៊ីនិត  ម៉េងហុង', 'បង់ខែ', 5.00, 0, '2026-08-11 09:03:43', '08:00', 0),
(98, 'សារី សីហា', 's', 10.00, 0, '2026-08-17 07:47:00', '6:00 - 7:00 pm', 0),
(99, 'ហេនស៊ាង ហ័រ', 'បង់ ', 5.00, 0, '2026-08-18 08:06:28', '2:00 - 3:00 pm', 0),
(100, 'រៀវ សំអាត', 'រួចរាល់', 25.00, 0, '2026-08-19 10:37:10', '5:00 - 6:00 pm', 0),
(101, 'អ៊ុម ជាវណ្ណរី', 'រួចរាល់', 25.00, 0, '2026-08-19 10:37:29', '5:00 - 6:00 pm', 0),
(102, 'បូរី អមរា (ត)', 'រួចរាល់', 10.00, 0, '2026-08-20 06:35:38', '6:00 - 7:00 pm', 0),
(104, 'ស៊ាន រចនា ', 'ស', 15.00, 0, '2026-08-20 10:35:11', '2:00 - 3:00 pm', 0),
(105, 'ហឿម មេត្តា', 'paid 8-6-26', 5.00, 0, '2026-08-24 09:36:41', '08:00', 0),
(106, 'ដុង ឌឿ', 'រួចរាល់', 25.00, 0, '2026-08-24 12:03:56', '7-8 ល្ងាច', 0),
(107, 'ចិន យ៉ាង', 'ពាក់កណ្ដាល', 12.50, 0, '2026-08-25 10:18:05', '3:00 - 4:00 pm', 0),
(108, 'សៅ សិម', 'ពាក់កណ្ដាល', 12.50, 0, '2026-08-25 10:18:22', '3:00 - 4:00 pm', 0),
(109, 'វ៉ិត សុវណ្ណ', 'ពាក់កណ្ដាល', 12.50, 0, '2026-08-25 10:18:42', '3:00 - 4:00 pm', 0),
(110, 'ពុធ ប៊ុនឆាង', 'រួចរាល់', 30.00, 0, '2026-08-26 10:34:37', '7-8 ល្ងាច', 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tb_invoices`
--
ALTER TABLE `tb_invoices`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `tb_invoices`
--
ALTER TABLE `tb_invoices`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=111;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
